УТ_для_edt/src/DataProcessors/смартКомплектацияНоменклатуры/смартКомплектацияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>смартКомплектацияНоменклатуры</name>
  <comment>#077 380 20.10.2020</comment>
  <attributes>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>СтараяНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказыНаСборку</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ЗаказНаСборку</types>
      </type>
    </attributes>
    <attributes>
      <name>СборкаТоваров</name>
      <type>
        <types>DocumentRef.СборкаТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходныйОрдер</name>
      <type>
        <types>DocumentRef.РасходныйОрдерНаТовары</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходныйОрдер</name>
      <type>
        <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Остатки</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Доступно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КОтгрузке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВРезерве</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ_для_edt/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НаборыУпаковок</owners>
  <attributes>
    <name>Безразмерная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейныеРазмерыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскаяГруппа</name>
    <type>
      <types>CatalogRef.СкладскиеГруппыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Типоразмер</name>
    <type>
      <types>CatalogRef.ТипоразмерыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоУпаковокМногооборотнойТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/DataProcessors/смартКомплектацияНоменклатуры/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиЗаполнениеОбъекта();
    ПараметрыРегистрации.Наименование = НСтр("ru='Комплектация номенклатуры (смарт)'");
    ПараметрыРегистрации.Информация = НСтр("ru='Комплектация номенклатуры (смарт)'");
    ПараметрыРегистрации.Версия = "1.0";
    ПараметрыРегистрации.Назначение.Добавить("Справочник.Номенклатура");
	
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
    
    Команда = ПараметрыРегистрации.Команды.Добавить();
    Команда.Идентификатор = "КомплектацияНоменклатурыСмарт";
    Команда.Представление = "Комплектация номенклатуры (смарт)";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	    
    Возврат ПараметрыРегистрации;
		
КонецФункции

Функция СформироватьТабличныйДокументСборка() Экспорт
	
	// Основной код взят из модуля менеджера документа СборкаТоваров, процедура ПечатьСборкаТоваров. 
	// Изменения отмечены комментариями от 28.10.2020
	
	//++ смарт:ММ 28.10.2020
	МассивОбъектов = Новый Массив;
	
	Для Каждого Строка Из ЗаказыНаСборку Цикл
		
		Если НЕ ЗначениеЗаполнено(Строка.СборкаТоваров) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивОбъектов.Добавить(Строка.СборкаТоваров);
	КонецЦикла;
	//-- смарт:ММ 28.10.2020	
	
	ДопКолонка = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	ВыводитьДопКолонку = ЗначениеЗаполнено(ДопКолонка);
	
	ЗапросПоДокументам = Новый Запрос;
	ЗапросПоДокументам.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросПоДокументам.Текст =
	//++ смарт:ММ 28.10.2020
	//"
	//|ВЫБРАТЬ
	//|	Документ.Ссылка                          КАК Ссылка,
	//|	Документ.Номер                           КАК Номер,
	//|	Документ.Дата                            КАК Дата,
	//|	Документ.Склад                           КАК Склад,
	//|	Документ.Организация                     КАК Организация,
	//|	ПРЕДСТАВЛЕНИЕ(Документ.Склад)            КАК СкладПредставление,
	//|	ПРЕДСТАВЛЕНИЕ(Документ.Организация)      КАК ОрганизацияПредставление,
	//|	Документ.Организация.Префикс             КАК Префикс,
	//|	Документ.Ответственный.ФизическоеЛицо.Наименование КАК ОтветственныйПредставление,
	//|	" + ?(ВыводитьДопКолонку, "Документ.Номенклатура." + ДопКолонка +" КАК ДопКолонка,", "") + "
	//|	Документ.Номенклатура                    КАК Номенклатура,
	//|	Документ.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	//|	Документ.Характеристика.НаименованиеПолное КАК ХарактеристикаПредставление,
	//|
	//|	ВЫБОР КОГДА Документ.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) ТОГДА
	//|			ПРЕДСТАВЛЕНИЕ(Документ.Номенклатура.ЕдиницаИзмерения)
	//|		ИНАЧЕ
	//|			ПРЕДСТАВЛЕНИЕ(Документ.Упаковка)
	//|	КОНЕЦ                                    КАК Упаковка,
	//|	Документ.КоличествоУпаковок              КАК Количество,
	//|	Документ.ХозяйственнаяОперация           КАК ХозяйственнаяОперация,
	//|	Документ.Товары.(
	//|
	//|		НомерСтроки КАК НомерСтроки,
	//|		" + ?(ВыводитьДопКолонку, "Номенклатура." + ДопКолонка +" КАК ДопКолонка,", "") + "
	//|		Номенклатура                        КАК Номенклатура,
	//|		Номенклатура.НаименованиеПолное     КАК НоменклатураПредставление,
	//|		Характеристика.НаименованиеПолное 	КАК ХарактеристикаПредставление,
	//|		Характеристика                      КАК Характеристика,
	//|		ВЫБОР
	//|			КОГДА Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) ТОГДА
	//|				ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.ЕдиницаИзмерения)
	//|			ИНАЧЕ
	//|				ПРЕДСТАВЛЕНИЕССЫЛКИ(Упаковка)
	//|		КОНЕЦ              КАК Упаковка,
	//|		КоличествоУпаковок КАК Количество
	//|
	//|	) КАК ТаблицаТовары
	//|ИЗ
	//|	Документ.СборкаТоваров КАК Документ
	//|
	//|ГДЕ
	//|	Документ.Ссылка В(&МассивОбъектов)
	//|УПОРЯДОЧИТЬ ПО
	//|	Дата, Ссылка, НомерСтроки
	//|";
	
	"
	|ВЫБРАТЬ
	|	ВТ.СборкаТоваров КАК СборкаТоваров,
	|	ВТ.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ 
	|	&ТЧ КАК ВТ
	|//////////////////////////////////////////////////////////
	|;
	|ВЫБРАТЬ
	|	МИНИМУМ(ВТ.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_МинимальныйНомерСтроки
	|ИЗ 
	|	ВТ_ТЧ КАК ВТ
	|ГДЕ
	|	ВТ.СборкаТоваров <> ЗНАЧЕНИЕ(Документ.СборкаТоваров.ПустаяСсылка)
	|//////////////////////////////////////////////////////////
	|;
	|ВЫБРАТЬ
	|	ВТ.СборкаТоваров КАК СборкаТоваров
	|ПОМЕСТИТЬ ВТ_ДокументДляШапки
	|ИЗ 
	|	ВТ_ТЧ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МинимальныйНомерСтроки КАК ВТ_МинимальныйНомерСтроки
	|		ПО ВТ.НомерСтроки = ВТ_МинимальныйНомерСтроки.НомерСтроки
	|//////////////////////////////////////////////////////////
	|;
	|ВЫБРАТЬ	
	|	ТаблицаТовары.Номенклатура                        КАК ТоварыНоменклатура,
	|	" + ?(ВыводитьДопКолонку, "ТаблицаТовары.Номенклатура." + ДопКолонка +" КАК ТоварыДопКолонка,", "") + "
	|	ТаблицаТовары.Номенклатура.НаименованиеПолное     КАК ТоварыНоменклатураПредставление,
	|	ТаблицаТовары.Характеристика.НаименованиеПолное 	КАК ТоварыХарактеристикаПредставление,
	|	ТаблицаТовары.Характеристика                      КАК ТоварыХарактеристика,
	|		ВЫБОР
	|			КОГДА Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) ТОГДА
	|				ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Номенклатура.ЕдиницаИзмерения)
	|			ИНАЧЕ
	|				ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Упаковка)
	|		КОНЕЦ              КАК ТоварыУпаковка,
	|	СУММА(ТаблицаТовары.КоличествоУпаковок) КАК ТоварыКоличество
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.СборкаТоваров.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Номенклатура,
	|" + ?(ВыводитьДопКолонку, "ТаблицаТовары.Номенклатура." + ДопКолонка + ",", "") + "
	|	ТаблицаТовары.Номенклатура.НаименованиеПолное,
	|	ТаблицаТовары.Характеристика.НаименованиеПолное,
	|	ТаблицаТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) ТОГДА
	|				ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Номенклатура.ЕдиницаИзмерения)
	|		ИНАЧЕ
	|				ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаТовары.Упаковка)
	|		КОНЕЦ            
	|
	|//////////////////////////////////////////////////////////
	|;
	|ВЫБРАТЬ
	|	СУММА(ВТ_Товары.ТоварыКоличество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ОбщееКоличество
	|ИЗ 
	|  ВТ_Товары КАК ВТ_Товары
	|//////////////////////////////////////////////////////////
	|;
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка                          КАК Ссылка,
	|	Документ.Номер                           КАК Номер,
	|	Документ.Дата                            КАК Дата,
	|	Документ.Склад                           КАК Склад,
	|	Документ.Организация                     КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(Документ.Склад)            КАК СкладПредставление,
	|	ПРЕДСТАВЛЕНИЕ(Документ.Организация)      КАК ОрганизацияПредставление,
	|	Документ.Организация.Префикс             КАК Префикс,
	|	Документ.Ответственный.ФизическоеЛицо.Наименование КАК ОтветственныйПредставление,
	|	" + ?(ВыводитьДопКолонку, "Документ.Номенклатура." + ДопКолонка +" КАК ДопКолонка,", "") + "
	|	Документ.Номенклатура                    КАК Номенклатура,
	|	Документ.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	|	Документ.Характеристика.НаименованиеПолное КАК ХарактеристикаПредставление,
	|
	|	ВЫБОР КОГДА Документ.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) ТОГДА
	|			ПРЕДСТАВЛЕНИЕ(Документ.Номенклатура.ЕдиницаИзмерения)
	|		ИНАЧЕ
	|			ПРЕДСТАВЛЕНИЕ(Документ.Упаковка)
	|	КОНЕЦ                                    КАК Упаковка,
	|	ВТ_ОбщееКоличество.Количество 			КАК Количество,
	|	Документ.ХозяйственнаяОперация 			КАК ХозяйственнаяОперация,
	//|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	" + ?(ВыводитьДопКолонку, "ТаблицаТовары.ТоварыДопКолонка КАК ТоварыДопКолонка,", "") + "
	|	ТаблицаТовары.ТоварыНоменклатура КАК ТоварыНоменклатура,
	|	ТаблицаТовары.ТоварыНоменклатураПредставление КАК ТоварыНоменклатураПредставление,
	|	ТаблицаТовары.ТоварыХарактеристикаПредставление КАК ТоварыХарактеристикаПредставление,
	|	ТаблицаТовары.ТоварыХарактеристика КАК ТоварыХарактеристика,
	|	ТаблицаТовары.ТоварыУпаковка КАК ТоварыУпаковка,
	|	ТаблицаТовары.ТоварыКоличество КАК ТоварыКоличество
	|ИЗ
	|	Документ.СборкаТоваров КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДокументДляШапки КАК ВТ_ДокументДляШапки
	|       ПО Документ.Ссылка = ВТ_ДокументДляШапки.СборкаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Товары КАК ТаблицаТовары
	|       ПО ИСТИНА
	|       ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщееКоличество КАК ВТ_ОбщееКоличество
	|       ПО ИСТИНА
	|
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата, Ссылка
	|ИТОГИ 
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Склад),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(СкладПредставление),
	|	МАКСИМУМ(ОрганизацияПредставление),
	|	МАКСИМУМ(Префикс),
	|	МАКСИМУМ(ОтветственныйПредставление),
	|	МАКСИМУМ(ДопКолонка),
	|	МАКСИМУМ(Номенклатура),
	|	МАКСИМУМ(НоменклатураПредставление),
	|	МАКСИМУМ(ХарактеристикаПредставление),
	|	МАКСИМУМ(Упаковка),
	|	МАКСИМУМ(Количество),
	|	МАКСИМУМ(ХозяйственнаяОперация)
	|ПО
	|	Ссылка
	|";
	ЗапросПоДокументам.УстановитьПараметр("ТЧ", ЗаказыНаСборку.Выгрузить());
	//-- смарт:ММ 28.10.2020
	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СборкаТоваров";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СборкаТоваров.ПФ_MXL_СборкаТоваров");
	
	Если ВыводитьДопКолонку Тогда
		ОбластьШапки  = "ШапкаСДопКолонкой";
		ОбластьСтроки = "СтрокаСДопКолонкой";
	Иначе
		ОбластьШапки  = "ШапкаТаблицы";
		ОбластьСтроки = "Строка";
	КонецЕсли;
	
	ПервыйДокумент = Истина;
	//++ смарт:ММ 28.10.2020 
	//ВыборкаДокументы = ЗапросПоДокументам.Выполнить().Выбрать();
	ВыборкаДокументы = ЗапросПоДокументам.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//-- смарт:ММ 28.10.2020
	
	Пока ВыборкаДокументы.Следующий() Цикл
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Вывод заголовка.
		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ВыборкаДокументы);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента, Строка(ВыборкаДокументы.ХозяйственнаяОперация));
		//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
		// Фролов+
		//ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДокумент, Макет, ОбластьМакета, ВыборкаДокументы.Ссылка);
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДокумент, Макет, ОбластьМакета, 
										?(ЗначениеЗаполнено(ВыборкаДокументы.Ссылка.ЗаказНаСборку),ВыборкаДокументы.Ссылка.ЗаказНаСборку,ВыборкаДокументы.Ссылка));
		// Фролов-
		//-- смарт:ММ 27.03.2020
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Вывод комплекта.
		Если ВыводитьДопКолонку Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("КомплектКод");
			ОбластьМакета.Параметры.ДопКолонка = ДопКолонка + ":";
			ОбластьМакета.Параметры.ЗначениеДопКолонки = ВыборкаДокументы.ДопКолонка;
			ТабДокумент.Вывести(ОбластьМакета);
			
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Комплект");
		ОбластьМакета.Параметры.Комплект = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			ВыборкаДокументы.НоменклатураПредставление,
			ВыборкаДокументы.ХарактеристикаПредставление);
		ОбластьМакета.Параметры.Количество = Строка(ВыборкаДокументы.Количество) + " " + ВыборкаДокументы.Упаковка;
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Вывод шапки отчета.
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
		Если ВыводитьДопКолонку Тогда
			ОбластьМакета.Параметры.ДопКолонка = ДопКолонка;
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Вывод строк документа.
		//++ смарт:ММ 28.10.2020
		//ВыборкаПоСтрокам = ВыборкаДокументы.ТаблицаТовары.Выбрать();
		ВыборкаПоСтрокам = ВыборкаДокументы.Выбрать();
		НомерСтроки = 1;
		//-- смарт:ММ 28.10.2020
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);
			ОбластьМакета.Параметры.Заполнить(ВыборкаПоСтрокам);
			
			//++ смарт:ММ 28.10.2020
			//ОбластьМакета.Параметры.НоменклатураПредставление = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			//	ВыборкаПоСтрокам.НоменклатураПредставление,
			//	ВыборкаПоСтрокам.ХарактеристикаПредставление);
			
			ОбластьМакета.Параметры.НоменклатураПредставление = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
				ВыборкаПоСтрокам.ТоварыНоменклатураПредставление,
				ВыборкаПоСтрокам.ТоварыХарактеристикаПредставление);

			ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
			ОбластьМакета.Параметры.Количество = ВыборкаПоСтрокам.ТоварыКоличество;
			ОбластьМакета.Параметры.Упаковка = ВыборкаПоСтрокам.ТоварыУпаковка;
			Если ВыводитьДопКолонку Тогда
				ОбластьМакета.Параметры.ДопКолонка = ВыборкаПоСтрокам.ДопКолонка;
			КонецЕсли;
			НомерСтроки = НомерСтроки + 1;
			//-- смарт:ММ 28.10.2020
			ТабДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;
		
		// Вывод подписей.
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		
		//++ смарт:ММ 30.10.2020
		//ОбластьМакета.Параметры.ОтветственныйПредставление = "/"+ ВыборкаДокументы.ОтветственныйПредставление + "/";
		Если ЗначениеЗаполнено(МОЛ) Тогда
			ФизлицоМОЛ = МОЛ.ФизическоеЛицо;
			Если ЗначениеЗаполнено(ФизлицоМОЛ) Тогда
				ОтветственныйПредставление = ФизлицоМОЛ;
			Иначе 
				ОтветственныйПредставление = МОЛ;
			КонецЕсли;
			
			ОбластьМакета.Параметры.ОтветственныйПредставление = "/" + ОтветственныйПредставление + "/";
		КонецЕсли;
		//-- смарт:ММ 30.10.2020
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		//УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументы.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция СформироватьТабличныйДокументПриказОбУтверждении() Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_смартПриказОбУтвержденииНовойНоменклатуры";
	
	Если ЗаказыНаСборку.Количество() = 0 Тогда
		Возврат ТабДокумент;
	КонецЕсли;
	
	ПервыйДокументСборка = ЗаказыНаСборку[0].СборкаТоваров;
	ДатаДокумента = ПервыйДокументСборка.Дата;
	
	Макет = ПолучитьМакет("ПриказОбУтвержденииНовойНоменклатуры");
	
	ОбластьПриказ = Макет.ПолучитьОбласть("Приказ");
	
	ОбластьПриказ.Параметры.Город = "г. Москва";
	ОбластьПриказ.Параметры.ДатаПриказа = ДатаДокумента;
	ОбластьПриказ.Параметры.ДатаВвода = Формат(ДатаДокумента, "ДФ='«dd» MMMM yyyy ""г.""'");
	ОбластьПриказ.Параметры.СтараяНоменклатура = СтараяНоменклатура;
	ОбластьПриказ.Параметры.НоваяНоменклатура = СсылкаНаОбъект;
	
	ТабДокумент.Вывести(ОбластьПриказ);
	
	// Колонтитул
	ТабДокумент.НижнийКолонтитул.НачальнаяСтраница = 1;
    ТабДокумент.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
    ТабДокумент.НижнийКолонтитул.Шрифт = Новый Шрифт("Arial", 10);
    ТабДокумент.НижнийКолонтитул.ТекстСлева = 
	"Исполнитель (Ф.И.О.)_________________
	|Тел.: ";
    ТабДокумент.РазмерКолонтитулаСнизу = 30;
    ТабДокумент.НижнийКолонтитул.Выводить = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции
